IDEA Open Model
ConnectionData Properties
The ConnectionData type exposes the following members.
Properties
Name | Description
Beams
 Connected beams
BoltGrids
 Bolt grids which belongs to the connection
ConcreteBlocks
 ConcreteBlocksof the connection
Plates
 Plates of the connection
Welds
 Welds of the connection
Top
See Also
Reference
ConnectionData Class
IdeaRS.OpenModel.Connection Namespace